backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, null, 128]
      dtype: float32
      name: input
      sparse: false
    inbound_nodes: []
    name: input
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dilation_rate: !!python/tuple [1]
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [5]
      name: conv1d_1
      padding: valid
      strides: !!python/tuple [1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - input
        - 0
        - 0
        - {}
    name: conv1d_1
  - class_name: Activation
    config: {activation: relu, name: activation_1, trainable: true}
    inbound_nodes:
    - - - conv1d_1
        - 0
        - 0
        - {}
    name: activation_1
  - class_name: MaxPooling1D
    config:
      name: max_pooling1d_1
      padding: valid
      pool_size: !!python/tuple [2]
      strides: !!python/tuple [2]
      trainable: true
    inbound_nodes:
    - - - activation_1
        - 0
        - 0
        - {}
    name: max_pooling1d_1
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dilation_rate: !!python/tuple [1]
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [5]
      name: conv1d_2
      padding: valid
      strides: !!python/tuple [1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling1d_1
        - 0
        - 0
        - {}
    name: conv1d_2
  - class_name: Activation
    config: {activation: relu, name: activation_2, trainable: true}
    inbound_nodes:
    - - - conv1d_2
        - 0
        - 0
        - {}
    name: activation_2
  - class_name: MaxPooling1D
    config:
      name: max_pooling1d_2
      padding: valid
      pool_size: !!python/tuple [2]
      strides: !!python/tuple [2]
      trainable: true
    inbound_nodes:
    - - - activation_2
        - 0
        - 0
        - {}
    name: max_pooling1d_2
  - class_name: Conv1D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dilation_rate: !!python/tuple [1]
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [5]
      name: conv1d_3
      padding: valid
      strides: !!python/tuple [1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling1d_2
        - 0
        - 0
        - {}
    name: conv1d_3
  - class_name: Activation
    config: {activation: relu, name: activation_3, trainable: true}
    inbound_nodes:
    - - - conv1d_3
        - 0
        - 0
        - {}
    name: activation_3
  - class_name: MaxPooling1D
    config:
      name: max_pooling1d_3
      padding: valid
      pool_size: !!python/tuple [2]
      strides: !!python/tuple [2]
      trainable: true
    inbound_nodes:
    - - - activation_3
        - 0
        - 0
        - {}
    name: max_pooling1d_3
  - class_name: Dropout
    config: {name: dropout_1, rate: 0.5, trainable: true}
    inbound_nodes:
    - - - max_pooling1d_3
        - 0
        - 0
        - {}
    name: dropout_1
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      go_backwards: false
      implementation: 0
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: lstm_1
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: true
      return_state: false
      stateful: false
      trainable: true
      unit_forget_bias: true
      units: 256
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - dropout_1
        - 0
        - 0
        - {}
    name: lstm_1
  - class_name: Dropout
    config: {name: dropout_2, rate: 0.5, trainable: true}
    inbound_nodes:
    - - - lstm_1
        - 0
        - 0
        - {}
    name: dropout_2
  - class_name: TimeDistributed
    config:
      layer:
        class_name: Dense
        config:
          activation: linear
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
          kernel_regularizer: null
          name: dense_1
          trainable: true
          units: 8
          use_bias: true
      name: time_distributed_1
      trainable: true
    inbound_nodes:
    - - - dropout_2
        - 0
        - 0
        - {}
    name: time_distributed_1
  - class_name: Activation
    config: {activation: softmax, name: output_realtime, trainable: true}
    inbound_nodes:
    - - - time_distributed_1
        - 0
        - 0
        - {}
    name: output_realtime
  - class_name: Lambda
    config:
      arguments: {}
      function: !!python/tuple ["\xE3\x01\0\0\0\0\0\0\0\x01\0\0\0\x04\0\0\0S\0\0\0\
          s\x0E\0\0\0t\0j\x01|\0d\x01d\x02\x8D\x02S\0)\x03N\xE9\x01\0\0\0)\x01\xDA\
          \x04axis)\x02\xDA\x01K\xDA\x04mean)\x01\xDA\x01x\xA9\0r\x06\0\0\0\xFA\n\
          trainer.py\xDA\b<lambda><\0\0\0s\0\0\0\0", null, null]
      function_type: lambda
      name: output_merged
      output_shape: !!python/tuple ["\xE3\x01\0\0\0\0\0\0\0\x01\0\0\0\x04\0\0\0S\0\
          \0\0s\x16\0\0\0|\0d\x01\x19\0f\x01|\0d\x02d\0\N\x02\x19\0\x17\0S\0)\x03\
          N\xE9\0\0\0\0\xE9\x02\0\0\0\xA9\0)\x01\xDA\x05shaper\x03\0\0\0r\x03\0\0\0\
          \xFA\ntrainer.py\xDA\b<lambda>=\0\0\0s\0\0\0\0", null, null]
      output_shape_type: lambda
      trainable: true
    inbound_nodes:
    - - - output_realtime
        - 0
        - 0
        - {}
    name: output_merged
  name: model_1
  output_layers:
  - [output_merged, 0, 0]
keras_version: 2.0.5
